{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "NO_RELATION",
    "1": "AND",
    "2": "Has_context",
    "3": "Has_index",
    "4": "Has_mood",
    "5": "Has_multiplier",
    "6": "Has_negation",
    "7": "Has_qualifier",
    "8": "Has_temporal",
    "9": "Has_value",
    "10": "OR",
    "11": "Subsumes"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "AND": 1,
    "Has_context": 2,
    "Has_index": 3,
    "Has_mood": 4,
    "Has_multiplier": 5,
    "Has_negation": 6,
    "Has_qualifier": 7,
    "Has_temporal": 8,
    "Has_value": 9,
    "NO_RELATION": 0,
    "OR": 10,
    "Subsumes": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29000
}
