{
  "backend": "tokenizers",
  "cls_token": "[CLS]",
  "do_lower_case": false,
  "extra_special_tokens": [
    "[E1]",
    "[/E1]",
    "[E2]",
    "[/E2]"
  ],
  "is_local": false,
  "mask_token": "[MASK]",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[PAD]",
  "sep_token": "[SEP]",
  "strip_accents": null,
  "tokenize_chinese_chars": true,
  "tokenizer_class": "BertTokenizer",
  "unk_token": "[UNK]"
}
