{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-Qualifier",
    "2": "I-Qualifier",
    "3": "B-Condition",
    "4": "I-Condition",
    "5": "B-Negation",
    "6": "I-Negation",
    "7": "B-Procedure",
    "8": "I-Procedure",
    "9": "B-Temporal",
    "10": "I-Temporal",
    "11": "B-Multiplier",
    "12": "I-Multiplier",
    "13": "B-Observation",
    "14": "I-Observation",
    "15": "B-Drug",
    "16": "I-Drug",
    "17": "B-Value",
    "18": "I-Value",
    "19": "B-Measurement",
    "20": "I-Measurement",
    "21": "B-Device",
    "22": "I-Device",
    "23": "B-Non-representable",
    "24": "I-Non-representable",
    "25": "B-Mood",
    "26": "I-Mood",
    "27": "B-Reference_point",
    "28": "I-Reference_point",
    "29": "B-Person",
    "30": "I-Person",
    "31": "B-Non-query-able",
    "32": "I-Non-query-able",
    "33": "B-Competing_trial",
    "34": "I-Competing_trial",
    "35": "B-Informed_consent",
    "36": "I-Informed_consent",
    "37": "B-Visit",
    "38": "I-Visit",
    "39": "B-Post-eligibility",
    "40": "I-Post-eligibility",
    "41": "B-Context_Error",
    "42": "I-Context_Error",
    "43": "B-Not_a_criteria",
    "44": "I-Not_a_criteria",
    "45": "B-Subjective_judgement",
    "46": "I-Subjective_judgement",
    "47": "B-Undefined_semantics",
    "48": "I-Undefined_semantics",
    "49": "B-Pregnancy_considerations",
    "50": "I-Pregnancy_considerations",
    "51": "B-Intoxication_considerations",
    "52": "I-Intoxication_considerations"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-Competing_trial": 33,
    "B-Condition": 3,
    "B-Context_Error": 41,
    "B-Device": 21,
    "B-Drug": 15,
    "B-Informed_consent": 35,
    "B-Intoxication_considerations": 51,
    "B-Measurement": 19,
    "B-Mood": 25,
    "B-Multiplier": 11,
    "B-Negation": 5,
    "B-Non-query-able": 31,
    "B-Non-representable": 23,
    "B-Not_a_criteria": 43,
    "B-Observation": 13,
    "B-Person": 29,
    "B-Post-eligibility": 39,
    "B-Pregnancy_considerations": 49,
    "B-Procedure": 7,
    "B-Qualifier": 1,
    "B-Reference_point": 27,
    "B-Subjective_judgement": 45,
    "B-Temporal": 9,
    "B-Undefined_semantics": 47,
    "B-Value": 17,
    "B-Visit": 37,
    "I-Competing_trial": 34,
    "I-Condition": 4,
    "I-Context_Error": 42,
    "I-Device": 22,
    "I-Drug": 16,
    "I-Informed_consent": 36,
    "I-Intoxication_considerations": 52,
    "I-Measurement": 20,
    "I-Mood": 26,
    "I-Multiplier": 12,
    "I-Negation": 6,
    "I-Non-query-able": 32,
    "I-Non-representable": 24,
    "I-Not_a_criteria": 44,
    "I-Observation": 14,
    "I-Person": 30,
    "I-Post-eligibility": 40,
    "I-Pregnancy_considerations": 50,
    "I-Procedure": 8,
    "I-Qualifier": 2,
    "I-Reference_point": 28,
    "I-Subjective_judgement": 46,
    "I-Temporal": 10,
    "I-Undefined_semantics": 48,
    "I-Value": 18,
    "I-Visit": 38,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
